Revit 2027 API
EnergyDataSettings.CheckAnalysisType Method
 Checks that the analysis type falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckAnalysisType(
	AnalysisMode analysisType
)
Public Shared Function CheckAnalysisType (
	analysisType As AnalysisMode
) As Boolean
public:
static bool CheckAnalysisType(
	AnalysisMode analysisType
)
static member CheckAnalysisType :
        analysisType : AnalysisMode -> bool
Parameters
analysisType AnalysisMode
 The analysis type to be checked.
Return Value
Boolean
 True if the analysis type falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace